	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 17.0.1.132 Build 20161005";
# mark_description "-S -qopt-report=5 -xMIC-AVX512 -g";
	.file "knl-ex1.c"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;
# Threads 2
        .align    16,0x90
	.globl main
# --- main(int, char **)
main:
# parameter 1(argc): %edi
# parameter 2(argv): %rsi
..B1.1:                         # Preds ..B1.0
                                # Execution count [1.00e+00]
	.cfi_startproc
..___tag_value_main.2:
..L3:
                                                          #72.34
..LN0:
	.file   1 "knl-ex1.c"
	.loc    1  72  is_stmt 1
        pushq     %rbp                                          #72.34
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #72.34
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #72.34
..LN3:
        subq      $256, %rsp                                    #72.34 c1
..LN4:
        movq      %rbx, 24(%rsp)                                #72.34[spill] c3
..LN5:
        movq      $0x7389d9ffe, %rsi                            #72.34 c3
..LN6:
        movq      %r15, 32(%rsp)                                #72.34[spill] c3
..LN7:
        movl      $3, %edi                                      #72.34 c3
..LN8:

	.long	-2138734462
	.long	-863993728
	.long	255885440
	.long	-2004320240
	.long	-2139062142
	.long	-863993728
	.word	32896
	.byte	64
	.section .note.GNU-stack, ""
	.global k#
	.global steps#
	.global stepstotal#
	.global SIZE#
	.global SIZE2#
	.global maxrange#
	.global a#
	.global b#
	.global o#
// -- Begin DWARF2 SEGMENT .debug_info
	.section .debug_info
.debug_info_seg:
	.align 1
	.4byte 0x0000031e
	.2byte 0x0004
	.4byte .debug_abbrev_seg
	.byte 0x08
//	DW_TAG_compile_unit:
	.byte 0x01
//	DW_AT_comp_dir:
	.4byte .debug_str
//	DW_AT_name:
	.4byte .debug_str+0x22
//	DW_AT_producer:
	.4byte .debug_str+0x2c
	.4byte .debug_str+0x98
//	DW_AT_language:
	.byte 0x01
//	DW_AT_use_UTF8:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN0
//	DW_AT_high_pc:
	.8byte ..LNsumArrayNOVEC.1966-..LN0
	.byte 0x01
//	DW_AT_stmt_list:
	.4byte .debug_line_seg
//	DW_TAG_base_type:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte 0x00746e69
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0x0f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x15d
	.4byte .debug_str+0x15d
//	DW_AT_low_pc:
	.8byte ..L66
//	DW_AT_high_pc:
	.8byte ..LNfillarray.1430-..L66
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x11
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x188
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_variable:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x12
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x190
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5e01
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x13
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x199
//	DW_AT_type:
	.4byte 0x00000033
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0x29
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a0
	.4byte .debug_str+0x1a0
//	DW_AT_low_pc:
	.8byte ..L102
//	DW_AT_high_pc:
	.8byte ..LNsumArray.1615-..L102
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x2b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x188
//	DW_AT_type:
	.4byte 0x00000033
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0x33
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1a9
	.4byte .debug_str+0x1a9
//	DW_AT_low_pc:
	.8byte ..L117
//	DW_AT_high_pc:
	.8byte ..LNsumArray2.1800-..L117
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x35
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x188
//	DW_AT_type:
	.4byte 0x00000033
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x03
//	DW_AT_decl_line:
	.byte 0x3d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1b3
	.4byte .debug_str+0x1b3
//	DW_AT_low_pc:
	.8byte ..L132
//	DW_AT_high_pc:
	.8byte ..LNsumArrayNOVEC.1966-..L132
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x188
//	DW_AT_type:
	.4byte 0x00000033
	.byte 0x00
//	DW_TAG_subprogram:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_prototyped:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0xba
	.4byte .debug_str+0xba
//	DW_AT_frame_base:
	.2byte 0x7702
	.byte 0x00
//	DW_AT_low_pc:
	.8byte ..L3
//	DW_AT_high_pc:
	.8byte ..LNmain.980-..L3
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_formal_parameter:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_name:
	.4byte .debug_str+0xbf
//	DW_AT_location:
	.2byte 0x5501
//	DW_TAG_formal_parameter:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0x48
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_type:
	.4byte 0x00000156
//	DW_AT_name:
	.4byte .debug_str+0xc9
//	DW_AT_location:
	.2byte 0x5401
//	DW_TAG_variable:
	.byte 0x05
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x13b
//	DW_AT_type:
	.4byte 0x00000171
//	DW_AT_location:
	.2byte 0x9102
	.byte 0x10
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x143
//	DW_AT_type:
	.4byte 0x00000244
//	DW_TAG_variable:
	.byte 0x04
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x151
//	DW_AT_type:
	.4byte 0x00000244
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x0000015b
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x00000160
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0xc4
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x0000016c
//	DW_TAG_const_type:
	.byte 0x0a
//	DW_AT_type:
	.4byte 0x00000171
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x4b
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0xce
//	DW_AT_type:
	.4byte 0x0000017c
//	DW_TAG_typedef:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0x94
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0xd5
//	DW_AT_type:
	.4byte 0x00000187
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0xde
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x00000193
//	DW_TAG_const_type:
	.byte 0x0a
//	DW_AT_type:
	.4byte 0x00000160
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x0000019d
//	DW_TAG_const_type:
	.byte 0x0a
//	DW_AT_type:
	.4byte 0x000001a2
//	DW_TAG_structure_type:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0x85
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x38
//	DW_AT_name:
	.2byte 0x6d74
	.byte 0x00
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x87
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0xe3
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x88
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0xea
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x89
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0xf1
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x8a
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x0c
//	DW_AT_name:
	.4byte .debug_str+0xf9
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x8b
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x101
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x8c
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x14
//	DW_AT_name:
	.4byte .debug_str+0x108
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x8d
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x110
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x8e
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x1c
//	DW_AT_name:
	.4byte .debug_str+0x118
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x8f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x120
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x92
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x129
//	DW_AT_type:
	.4byte 0x00000187
//	DW_TAG_member:
	.byte 0x0d
//	DW_AT_decl_line:
	.byte 0x93
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x133
//	DW_AT_type:
	.4byte 0x0000018e
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x000001a2
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x167
//	DW_TAG_pointer_type:
	.byte 0x08
//	DW_AT_type:
	.4byte 0x00000255
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x174
//	DW_TAG_base_type:
	.byte 0x09
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x17a
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x04
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006b
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x0309
	.8byte k
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x05
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1c1
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x0309
	.8byte steps
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x06
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1c7
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x0309
	.8byte stepstotal
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x07
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1d2
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x0309
	.8byte SIZE
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x08
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1d7
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x0309
	.8byte SIZE2
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0f
//	DW_AT_decl_line:
	.byte 0x09
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x1dd
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x0309
	.8byte maxrange
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x0b
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0061
//	DW_AT_type:
	.4byte 0x00000250
//	DW_AT_location:
	.2byte 0x0309
	.8byte a
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x0c
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0062
//	DW_AT_type:
	.4byte 0x00000250
//	DW_AT_location:
	.2byte 0x0309
	.8byte b
//	DW_AT_external:
	.byte 0x01
//	DW_TAG_variable:
	.byte 0x0e
//	DW_AT_decl_line:
	.byte 0x0d
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006f
//	DW_AT_type:
	.4byte 0x00000250
//	DW_AT_location:
	.2byte 0x0309
	.8byte o
//	DW_AT_external:
	.byte 0x01
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x10
	.byte 0x17
	.2byte 0x0000
	.byte 0x02
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x04
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x05
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
